{
  "aaa": {
    "username": "aaa",
    "password": "aaa",
    "name": "aaa",
    "age": 16,
    "sex": "female",
    "height": 157.0,
    "weight": 55.0,
    "skin_color": "light",
    "country": "netherlands",
    "medication": [
      ""
    ],
    "diet": "none",
    "existing_conditions": [
      ""
    ],
    "allergies": [
      ""
    ],
    "saved_recipes": [
      715446,
      756814,
      782601
    ],
    "analysis_results": [
      {
        "symptoms": "acne",
        "analyse": {
          "Vitamin A": {
            "why": "As a 16-year-old female, a lack of Vitamin A can contribute to acne due to its role in regulating skin cell turnover and reducing inflammation. With a height of 157.0 cm and weight of 55.0 kg, adequate Vitamin A is essential for maintaining healthy skin.",
            "foods": [
              "sweet potatoes",
              "carrots",
              "dark leafy greens",
              "squash",
              "liver"
            ],
            "tip": "Include Vitamin A-rich foods in your daily meals, such as having sweet potatoes for breakfast or snacking on carrots."
          },
          "Zinc": {
            "why": "A lack of Zinc can impair wound healing and contribute to acne in adolescents, particularly females. Zinc's role in regulating inflammation and immune response is crucial during puberty.",
            "foods": [
              "oysters",
              "beef",
              "chicken",
              "fortified cereals",
              "pumpkin seeds"
            ],
            "tip": "Snack on pumpkin seeds or add them to your salads to boost Zinc intake."
          },
          "Omega-3": {
            "why": "A lack of Omega-3 fatty acids can lead to increased inflammation, which may exacerbate acne. As a female, Omega-3 is essential for hormonal balance and skin health.",
            "foods": [
              "salmon",
              "walnuts",
              "chia seeds",
              "flaxseeds",
              "sardines"
            ],
            "tip": "Incorporate walnuts or chia seeds into your daily snacks or meals to increase Omega-3 intake."
          }
        }
      },
      {
        "symptoms": "acne",
        "analyse": {
          "Vitamin A": {
            "why": "As a 16-year-old female, a lack of Vitamin A can contribute to acne due to its role in regulating skin cell turnover and reducing inflammation. With a height of 157.0 cm and weight of 55.0 kg, adequate Vitamin A is essential for maintaining healthy skin.",
            "foods": [
              "sweet potatoes",
              "carrots",
              "dark leafy greens",
              "squash",
              "liver"
            ],
            "tip": "Include Vitamin A-rich foods in your daily meals, and consider keeping a food diary to track any changes."
          },
          "Zinc": {
            "why": "A lack of Zinc can impair wound healing and contribute to acne in adolescents, particularly females. Zinc's role in immune function and inflammation regulation is crucial during puberty.",
            "foods": [
              "oysters",
              "beef",
              "chicken",
              "fortified cereals",
              "pumpkin seeds"
            ],
            "tip": "Eat zinc-rich foods with vitamin C-rich foods to enhance absorption, and consider taking a balanced multivitamin if your diet is lacking."
          },
          "Omega-3": {
            "why": "A lack of Omega-3 fatty acids can lead to increased inflammation, which may exacerbate acne. As a 16-year-old female, adequate Omega-3 intake supports healthy skin and hormone regulation.",
            "foods": [
              "salmon",
              "walnuts",
              "chia seeds",
              "flaxseeds",
              "sardines"
            ],
            "tip": "Incorporate Omega-3 rich foods into your diet 2-3 times a week, and consider consulting a healthcare professional about supplementing if necessary."
          }
        }
      },
      {
        "symptoms": "fatigue",
        "analyse": {
          "Iron Lack": {
            "why": "As a 16-year-old female, aaa is at risk for iron lack due to menstruation, which can lead to fatigue. Her age and sex put her in a high-risk group for iron lack, which can impair oxygen delivery to cells, leading to fatigue.",
            "foods": [
              "spinach",
              "beans",
              "fortified cereals",
              "pumpkin seeds",
              "turkey",
              "chicken",
              "fish"
            ],
            "tip": "Engage in regular exercise to improve circulation and help your body utilize iron more efficiently."
          },
          "Vitamin B12 Lack": {
            "why": "As a 16-year-old female, aaa's diet may not include sufficient animal products, which are primary sources of vitamin B12. A lack of vitamin B12 can cause fatigue, as it's essential for energy production. Her skin tone and age do not directly impact vitamin B12 levels, but her diet might.",
            "foods": [
              "salmon",
              "beef",
              "chicken",
              "eggs",
              "milk",
              "fortified plant-based milk",
              "nutritional yeast"
            ],
            "tip": "Consider keeping a food diary to track your vitamin B12 intake and ensure you're meeting your daily needs."
          },
          "Magnesium Lack": {
            "why": "aaa's fatigue could be related to a lack of magnesium, which plays a crucial role in energy production. As a teenager, her body is rapidly growing, increasing her magnesium needs. A lack of magnesium can also affect muscle function and energy levels.",
            "foods": [
              "dark leafy greens",
              "almonds",
              "bananas",
              "avocados",
              "brown rice",
              "quinoa",
              "black beans"
            ],
            "tip": "Practice relaxation techniques, such as deep breathing or meditation, to help manage stress and conserve magnesium."
          },
          "Urgency Note": "None flagged based on provided information. However, if aaa's fatigue persists or worsens, consult a healthcare professional to rule out underlying medical conditions."
        }
      },
      {
        "symptoms": "acne",
        "analyse": {
          "Vitamin A": {
            "why": "As a 16-year-old female, a lack of Vitamin A can contribute to acne due to its role in regulating skin cell turnover and reducing inflammation. At 157cm and 55kg, adequate Vitamin A is essential for maintaining healthy skin.",
            "foods": [
              "sweet potatoes",
              "carrots",
              "dark leafy greens",
              "squash",
              "liver"
            ],
            "tip": "Include Vitamin A-rich foods in your daily meals, and consider keeping a food diary to track any improvements."
          },
          "Zinc": {
            "why": "Zinc plays a crucial role in regulating hormones, reducing inflammation, and promoting wound healing. A lack of Zinc can exacerbate acne, particularly during puberty. As a female, adequate Zinc intake is essential for menstrual health and hormonal balance.",
            "foods": [
              "oysters",
              "beef",
              "chicken",
              "fortified cereals",
              "pumpkin seeds"
            ],
            "tip": "Eat a balanced diet that includes Zinc-rich foods, and avoid excessive sugar intake which can lead to Zinc loss."
          },
          "Omega-3": {
            "why": "Omega-3 fatty acids help reduce inflammation, promote healthy skin, and regulate hormones. A lack of Omega-3 can contribute to acne, particularly in individuals with a diet high in processed foods. As a 16-year-old female, adequate Omega-3 intake supports menstrual health and skin health.",
            "foods": [
              "salmon",
              "walnuts",
              "chia seeds",
              "flaxseeds",
              "fortified eggs"
            ],
            "tip": "Incorporate Omega-3 rich foods into your diet, and consider taking a short walk outside during the day to boost Vitamin D levels, which work in conjunction with Omega-3."
          }
        }
      },
      {
        "symptoms": "hairloss",
        "analyse": {
          "Iron Lack": {
            "why": "As a 16-year-old female, aaa is likely to experience iron loss due to menstruation. Her light skin tone and hair loss symptoms also suggest a possible lack of iron, which is essential for healthy hair growth. With a height of 157.0 cm and weight of 55.0 kg, her body mass index (BMI) is within the normal range, but iron needs may still be high due to her age and sex.",
            "foods": [
              "spinach",
              "beans",
              "lentils",
              "fortified cereals",
              "red meat",
              "poultry"
            ],
            "tip": "Engage in regular exercise to improve blood circulation and promote healthy hair growth."
          },
          "Biotin Lack": {
            "why": "Biotin plays a crucial role in hair growth, and a lack of it can lead to hair loss. As a teenager, aaa's body is rapidly growing and developing, which may increase her biotin needs. Her diet is listed as \"none,\" which may indicate a possible lack of biotin-rich foods.",
            "foods": [
              "eggs",
              "nuts",
              "leafy greens",
              "whole grains",
              "sweet potatoes",
              "avocado"
            ],
            "tip": "Reduce heat styling and use gentle hair care products to minimize hair damage."
          },
          "Vitamin D Lack": {
            "why": "Vitamin D is essential for overall health, and a lack of it has been linked to hair loss. As a 16-year-old female with light skin tone, aaa may be more susceptible to vitamin D deficiency due to reduced melanin, which helps protect against UV radiation. Her age and sex also make her more likely to spend time indoors, reducing sun exposure.",
            "foods": [
              "fatty fish",
              "fortified dairy products",
              "mushrooms",
              "egg yolks",
              "fortified cereals"
            ],
            "tip": "Spend time outdoors during peak sun hours (10am-4pm) for 10-15 minutes to boost vitamin D production."
          },
          "Urgency Note": "No urgent medical concerns are flagged based on the provided information. However, it is recommended that aaa consult a healthcare professional to rule out underlying conditions that may be contributing to her hair loss."
        }
      },
      {
        "symptoms": "hairloss",
        "analyse": {
          "Iron Lack": {
            "why": "As a 16-year-old female, aaa is prone to iron lack due to menstruation, which can lead to hair loss. Her height and weight are within normal ranges, but iron is essential for healthy hair growth.",
            "foods": [
              "Spinach",
              "beans",
              "lentils",
              "fortified cereals",
              "pumpkin seeds",
              "iron-fortified bread"
            ],
            "tip": "Engage in regular exercise to improve blood circulation, which helps deliver iron to hair follicles."
          },
          "Biotin Lack": {
            "why": "Biotin is crucial for hair growth, and a lack of it can lead to hair loss. As a teenager, aaa's diet might not include sufficient biotin-rich foods. Her light skin tone doesn't directly relate to biotin levels, but biotin is essential for maintaining healthy skin and hair.",
            "foods": [
              "Eggs",
              "almonds",
              "walnuts",
              "sweet potatoes",
              "avocado",
              "oats"
            ],
            "tip": "Use gentle hair care products and avoid excessive heat styling to minimize hair damage."
          },
          "Vitamin D Lack": {
            "why": "Vitamin D is important for overall health, and research suggests a link between vitamin D and hair growth. As a teenager, aaa might spend more time indoors, limiting her sun exposure, which is necessary for vitamin D production. Her light skin tone may also affect vitamin D production.",
            "foods": [
              "Fatty fish",
              "fortified dairy products",
              "mushrooms",
              "fortified orange juice",
              "cereals"
            ],
            "tip": "Spend time outdoors during peak sun hours (10 am - 4 pm) for 10-15 minutes to boost vitamin D production."
          },
          "Urgency Note": "None flagged. However, if hair loss persists or worsens, consult a healthcare professional to rule out underlying conditions."
        }
      },
      {
        "symptoms": "fatigue",
        "analyse": {
          "Iron Lack": {
            "why": "As a 16-year-old female, aaa is at risk for iron lack due to menstrual blood loss. Iron is essential for transporting oxygen to cells, and a lack of iron can cause fatigue. With a height of 157.0 cm and weight of 55.0 kg, aaa's body requires a sufficient amount of iron to maintain healthy red blood cells.",
            "foods": [
              "Spinach",
              "beans",
              "lentils",
              "fortified cereals",
              "red meat",
              "poultry",
              "fish"
            ],
            "tip": "Engage in regular exercise, like short walks during lunch breaks, to improve circulation and help reduce fatigue."
          },
          "Vitamin B12 Lack": {
            "why": "As a 16-year-old female, aaa's body requires vitamin B12 to produce red blood cells and maintain the nervous system. A lack of vitamin B12 can cause fatigue, and since aaa is not on any medication or have existing conditions, it's essential to ensure adequate intake.",
            "foods": [
              "Salmon",
              "eggs",
              "fortified plant-based milk",
              "beef",
              "chicken",
              "fish",
              "yogurt"
            ],
            "tip": "Limit intake of processed foods and focus on whole foods to ensure sufficient vitamin B12."
          },
          "Magnesium Lack": {
            "why": "Magnesium is crucial for energy production, and a lack of magnesium can cause fatigue. As a 16-year-old female with a light skin tone, aaa may be more susceptible to magnesium lack.",
            "foods": [
              "Dark leafy greens",
              "almonds",
              "cashews",
              "brown rice",
              "quinoa",
              "black beans"
            ],
            "tip": "Practice stress-reducing techniques, such as deep breathing or meditation, to help regulate magnesium levels."
          },
          "Urgency Note": "None flagged. However, if fatigue persists, consult a healthcare professional to rule out underlying conditions."
        }
      },
      {
        "symptoms": "acne",
        "analyse": {
          "Vitamin A": {
            "why": "At 16 years old, aaa's body is still developing, and a lack of Vitamin A can lead to acne due to its role in regulating skin cell turnover and sebum production. As a female, aaa's skin tone is light, which may increase her risk of sun damage, but Vitamin A helps protect against this.",
            "foods": [
              "sweet potatoes",
              "carrots",
              "dark leafy greens",
              "squash",
              "liver"
            ],
            "tip": "Incorporate Vitamin A-rich foods into your daily meals, like having sweet potatoes for breakfast."
          },
          "Zinc": {
            "why": "Zinc plays a crucial role in hormone regulation, and a lack of it can disrupt the balance of hormones that contribute to acne. As a 16-year-old female, aaa's body is still regulating its hormonal balance, making zinc essential. Her light skin tone may also make her more prone to acne.",
            "foods": [
              "oysters",
              "beef",
              "chicken",
              "fortified cereals",
              "pumpkin seeds"
            ],
            "tip": "Snack on pumpkin seeds or nuts to boost your zinc intake."
          },
          "Omega-3": {
            "why": "Omega-3 fatty acids help reduce inflammation, which can contribute to acne. As a 16-year-old female, aaa's body can benefit from omega-3s to regulate her hormonal balance and reduce inflammation.",
            "foods": [
              "salmon",
              "walnuts",
              "chia seeds",
              "flaxseeds",
              "sardines"
            ],
            "tip": "Try to include fatty fish like salmon in your meals at least twice a week."
          }
        }
      }
    ],
    "mealplan": {
      "meals": [
        {
          "id": 660368,
          "image": "Smoked-Salmon-Eggs-Benedict-With-Lemon-Dill-Hollandaise-660368.jpg",
          "imageType": "jpg",
          "title": "Smoked Salmon Eggs Benedict With Lemon Dill Hollandaise",
          "readyInMinutes": 45,
          "servings": 2,
          "sourceUrl": "https://www.foodista.com/recipe/MZTVJFS5/smoked-salmon-eggs-benedict-with-lemon-dill-hollandaise"
        },
        {
          "id": 1178323,
          "image": "instant-pot-chili-1178323.jpg",
          "imageType": "jpg",
          "title": "Instant Pot Chili",
          "readyInMinutes": 30,
          "servings": 6,
          "sourceUrl": "https://www.pinkwhen.com/instant-pot-chili/"
        },
        {
          "id": 631750,
          "image": "Flank-Steak-with-Mushroom-Sauce-631750.jpg",
          "imageType": "jpg",
          "title": "Flank Steak with Mushroom Sauce",
          "readyInMinutes": 45,
          "servings": 4,
          "sourceUrl": "https://www.foodista.com/recipe/F4D23G25/flank-steak-with-mushroom-sauce"
        }
      ],
      "nutrients": {
        "calories": 1073.19,
        "protein": 82.96,
        "fat": 56.23,
        "carbohydrates": 63.83
      }
    }
  },
  "bbb": {
    "username": "bbb",
    "password": "bbb",
    "name": "bbb",
    "age": 20,
    "sex": "female",
    "height": 160.0,
    "weight": 55.0,
    "skin_color": "light",
    "country": "germany",
    "medication": [
      ""
    ],
    "diet": "glutenfree",
    "existing_conditions": [
      ""
    ],
    "allergies": [
      ""
    ],
    "saved_recipes": [],
    "analysis_results": [
      {
        "symptoms": "acne",
        "analyse": {
          "Vitamin A": {
            "why": "As a 20-year-old female with light skin tone, bbb may experience a lack of Vitamin A, which is essential for skin health and acne prevention. At her age, hormonal fluctuations can lead to increased sebum production, making acne more likely. A lack of Vitamin A can exacerbate this issue.",
            "foods": [
              "sweet potatoes",
              "carrots",
              "dark leafy greens",
              "squash",
              "liver"
            ],
            "tip": "Eat foods rich in Vitamin A with a source of healthy fat, like nuts or avocado, to enhance absorption."
          },
          "Zinc": {
            "why": "As a young adult, bbb's skin is still developing, and a lack of Zinc can disrupt the skin's natural barrier function, leading to acne. Zinc also regulates hormones, which can help reduce acne. Given her gluten-free diet, bbb may be at risk for a lack of Zinc if she's not consuming enough whole grains.",
            "foods": [
              "oysters",
              "beef",
              "chicken",
              "fortified cereals",
              "pumpkin seeds"
            ],
            "tip": "Take a warm bath with Epsom salt to help reduce stress and promote Zinc absorption."
          },
          "Omega-3": {
            "why": "As a female, bbb is more prone to hormonal fluctuations, which can lead to inflammation and acne. A lack of Omega-3 fatty acids can exacerbate inflammation, making acne worse. Given her age and sex, bbb may benefit from increasing her Omega-3 intake.",
            "foods": [
              "salmon",
              "walnuts",
              "chia seeds",
              "flaxseeds",
              "hemp seeds"
            ],
            "tip": "Incorporate Omega-3 rich foods into your breakfast routine, like adding walnuts to oatmeal or yogurt."
          },
          "Urgency Note": "None flagged. However, if acne persists or worsens, consult a dermatologist to rule out underlying conditions."
        }
      },
      {
        "symptoms": "acne",
        "analyse": {
          "Vitamin A": {
            "why": "As a 20-year-old female, bbb's skin health is crucial, and a lack of Vitamin A can lead to acne due to its role in regulating skin cell turnover and sebum production. At 170cm and 55kg, her body mass index (BMI) is within the normal range, but her gluten-free diet may limit her Vitamin A-rich food intake.",
            "foods": [
              "sweet potatoes",
              "carrots",
              "dark leafy greens",
              "squash",
              "liver"
            ],
            "tip": "Include Vitamin A-rich foods in your daily meals to support skin health."
          },
          "Zinc": {
            "why": "Zinc plays a crucial role in regulating acne, and a lack of it can exacerbate skin issues. As a female, bbb's body requires adequate zinc for hormonal balance, and her gluten-free diet may affect zinc absorption.",
            "foods": [
              "oysters",
              "beef",
              "chicken",
              "fortified cereals",
              "pumpkin seeds"
            ],
            "tip": "Eat zinc-rich foods to support your immune system and skin health."
          },
          "Omega-3": {
            "why": "Omega-3 fatty acids help reduce inflammation, which can contribute to acne. As a 20-year-old female, bbb's body benefits from omega-3's anti-inflammatory properties, particularly during hormonal fluctuations.",
            "foods": [
              "salmon",
              "walnuts",
              "chia seeds",
              "flaxseeds",
              "sardines"
            ],
            "tip": "Incorporate omega-3 rich foods into your diet to reduce inflammation."
          }
        }
      },
      {
        "symptoms": "acne",
        "analyse": {
          "Vitamin A": {
            "why": "As a 20-year-old female with light skin tone, a lack of Vitamin A may contribute to acne due to its role in regulating skin cell turnover and preventing clogged pores. At 170cm and 55kg, adequate Vitamin A is essential for maintaining healthy skin.",
            "foods": [
              "sweet potatoes",
              "carrots",
              "dark leafy greens",
              "squash",
              "cantaloupe"
            ],
            "tip": "Include Vitamin A-rich foods in your daily meals to support skin health."
          },
          "Zinc": {
            "why": "A lack of Zinc can exacerbate acne in young adults, particularly females, as it regulates sebum production and inflammation. With a gluten-free diet, it's essential to ensure adequate Zinc intake, as gluten-containing foods are often rich in this mineral.",
            "foods": [
              "oysters",
              "beef",
              "chicken",
              "fortified cereals",
              "pumpkin seeds"
            ],
            "tip": "Snack on pumpkin seeds or nuts to boost your Zinc intake."
          },
          "Omega-3": {
            "why": "A lack of Omega-3 fatty acids can contribute to inflammation, which may worsen acne. As a 20-year-old female, adequate Omega-3 intake is crucial for hormonal balance and skin health.",
            "foods": [
              "salmon",
              "walnuts",
              "chia seeds",
              "flaxseeds",
              "hemp seeds"
            ],
            "tip": "Incorporate walnuts or chia seeds into your breakfast routine to support skin health."
          },
          "Urgency Note": "None flagged. However, if acne persists or worsens, consult a healthcare professional to rule out underlying conditions."
        }
      },
      {
        "symptoms": "fatigue",
        "analyse": {
          "Iron Lack": {
            "why": "As a 20-year-old female, bbb is at risk for iron lack due to menstrual blood loss. Her age and sex put her in a high-risk group for iron deficiency anemia. With a gluten-free diet, she may be more likely to have a limited iron intake. Fatigue is a common symptom of iron lack, as iron plays a crucial role in transporting oxygen to cells.",
            "foods": [
              "spinach",
              "beans",
              "lentils",
              "fortified cereals",
              "quinoa",
              "pumpkin seeds"
            ],
            "tip": "Take vitamin C-rich foods like citrus fruits or bell peppers with iron-rich foods to enhance absorption."
          },
          "B12 Lack": {
            "why": "As a young adult, bbb may have a limited intake of vitamin B12, which is primarily found in animal products. A gluten-free diet may lead to a higher risk of B12 lack if her diet is not well-planned. B12 plays a crucial role in energy production, and a lack can cause fatigue.",
            "foods": [
              "salmon",
              "eggs",
              "fortified plant-based milk",
              "nutritional yeast",
              "beef",
              "chicken"
            ],
            "tip": "Consider taking a vitamin B12 supplement or consuming fortified foods regularly to maintain adequate levels."
          },
          "Magnesium Lack": {
            "why": "A diet lacking in magnesium-rich foods can lead to a lack, and fatigue is a common symptom. As a gluten-free dieter, bbb may be more likely to have a low magnesium intake. Her age, sex, and height/weight also put her at risk for magnesium lack.",
            "foods": [
              "dark leafy greens",
              "almonds",
              "black beans",
              "brown rice",
              "quinoa",
              "avocado"
            ],
            "tip": "Engage in regular physical activity, like yoga or walking, to help regulate magnesium levels and reduce fatigue."
          },
          "Urgency Note": "None flagged. However, if fatigue persists, it's essential to consult a healthcare professional to rule out underlying medical conditions."
        }
      },
      {
        "symptoms": "fatigue",
        "analyse": {
          "Iron Lack": {
            "why": "As a 20-year-old female, bbb is at risk for iron lack due to menstrual blood loss. Her gluten-free diet is not a concern for iron intake, but her fatigue could be a sign of iron lack. At 160cm and 55kg, her body mass index (BMI) is within the normal range, but iron needs can be higher in females due to menstrual cycles.",
            "foods": [
              "spinach",
              "beans",
              "lentils",
              "fortified cereals",
              "pumpkin seeds",
              "quinoa"
            ],
            "tip": "Take vitamin C-rich foods like orange juice or bell peppers with iron-rich foods to enhance absorption."
          },
          "Vitamin B12 Lack": {
            "why": "As a young adult, bbb's diet might not include enough animal products, which are primary sources of vitamin B12. A lack of vitamin B12 can cause fatigue, and since she's gluten-free, she might be relying on alternative grains that aren't fortified with B12.",
            "foods": [
              "salmon",
              "eggs",
              "fortified plant-based milk",
              "beef",
              "chicken",
              "yogurt"
            ],
            "tip": "Consider consulting a doctor about vitamin B12 supplements if dietary changes don't improve symptoms."
          },
          "Magnesium Lack": {
            "why": "A lack of magnesium can cause fatigue, and it's common in young adults, especially females. bbb's gluten-free diet might be low in magnesium-rich whole grains. At 20 years old, her bodily demands for magnesium are relatively high due to growth and development.",
            "foods": [
              "dark chocolate",
              "almonds",
              "avocado",
              "brown rice",
              "chickpeas",
              "spinach"
            ],
            "tip": "Practice relaxation techniques like deep breathing or meditation to help reduce magnesium-depleting stress."
          },
          "Urgency Note": "No urgent medical concerns flagged based on the provided information. However, persistent fatigue should be evaluated by a healthcare professional to rule out underlying conditions."
        }
      }
    ],
    "mealplan": {
      "meals": [
        {
          "id": 658134,
          "image": "Redneck-Breakfast-on-a-Croissant-658134.jpg",
          "imageType": "jpg",
          "title": "Redneck Breakfast on a Croissant",
          "readyInMinutes": 45,
          "servings": 1,
          "sourceUrl": "https://www.foodista.com/recipe/T58SBZQ4/redneck-breakfast-on-a-croissant"
        },
        {
          "id": 642593,
          "image": "Farfalle-With-Sun-Dried-Tomato-Pesto--Sausage-and-Fennel-642593.jpg",
          "imageType": "jpg",
          "title": "Farfalle With Sun-Dried Tomato Pesto, Sausage and Fennel",
          "readyInMinutes": 20,
          "servings": 4,
          "sourceUrl": "https://www.foodista.com/recipe/CSLBDWBS/farfalle-with-sun-dried-tomato-pesto-sausage-and-fennel"
        },
        {
          "id": 638431,
          "image": "Chicken-with-Cherry-Tomato-Heavy-Cream-Sauce-638431.jpg",
          "imageType": "jpg",
          "title": "Chicken with Cherry Tomato Heavy Cream Sauce",
          "readyInMinutes": 45,
          "servings": 2,
          "sourceUrl": "https://www.foodista.com/recipe/6TNVYX6Q/chicken-with-cherry-tomato-heavy-cream-sauce"
        }
      ],
      "nutrients": {
        "calories": 1865.22,
        "protein": 103.5,
        "fat": 93.82,
        "carbohydrates": 150.12
      }
    }
  }
}